andreq114/SmartFridgeLPC/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define IOCON_PIO_DIGITAL_EN 0x0100u    /*!<@brief Enables digital function */
#define IOCON_PIO_FUNC0 0x00u           /*!<@brief Selects pin function 0 */
#define IOCON_PIO_FUNC1 0x01u           /*!<@brief Selects pin function 1 */
#define IOCON_PIO_FUNC6 0x06u           /*!<@brief Selects pin function 6 */
#define IOCON_PIO_I2CDRIVE_HIGH 0x0400u /*!<@brief High drive: 20 mA */
#define IOCON_PIO_I2CFILTER_EN 0x00u    /*!<@brief I2C 50 ns glitch filter enabled */
#define IOCON_PIO_I2CSLEW_I2C 0x00u     /*!<@brief I2C mode */
#define IOCON_PIO_INPFILT_OFF 0x0200u   /*!<@brief Input filter disabled */
#define IOCON_PIO_INV_DI 0x00u          /*!<@brief Input function is not inverted */
#define IOCON_PIO_MODE_INACT 0x00u      /*!<@brief No addition pin function */
#define IOCON_PIO_MODE_PULLUP 0x20u     /*!<@brief Selects pull-up function */
#define IOCON_PIO_OPENDRAIN_DI 0x00u    /*!<@brief Open drain is disabled */
#define IOCON_PIO_SLEW_FAST 0x0400u     /*!<@brief Fast mode, slew rate control is disabled */
#define IOCON_PIO_SLEW_STANDARD 0x00u   /*!<@brief Standard mode, output slew rate control is enabled */
#define PIO122_DIGIMODE_DIGITAL 0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO122_FUNC_ALT0 0x00u          /*!<@brief Selects pin function.: Alternative connection 0. */
#define PIO331_DIGIMODE_DIGITAL 0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO331_FUNC_ALT2 0x02u          /*!<@brief Selects pin function.: Alternative connection 2. */

/*! @name PIO0_7 (coord H12), U28[D9]/RP5[3]/P0_7-EMC_D5
  @{ */
#define BOARD_INITPINS_EMC_D5_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EMC_D5_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EMC_D5_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PIO0_8 (coord H10), U28[D8]/RP5[2]/P0_8-EMC_D6
  @{ */
#define BOARD_INITPINS_EMC_D6_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EMC_D6_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EMC_D6_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PIO0_9 (coord G12), U28[E9]/RP5[1]/P0_9-EMC_D7
  @{ */
#define BOARD_INITPINS_EMC_D7_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EMC_D7_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EMC_D7_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PIO0_15 (coord L4), U28[F9]/P0_15-EMC_WEn
  @{ */
#define BOARD_INITPINS_EMC_WEn_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EMC_WEn_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EMC_WEn_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO0_18 (coord C14), U28[H7]/P0_18-EMC_A0
  @{ */
#define BOARD_INITPINS_EMC_A0_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EMC_A0_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EMC_A0_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO0_19 (coord C6), U28[H8]/P0_19-EMC_A1
  @{ */
#define BOARD_INITPINS_EMC_A1_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EMC_A1_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EMC_A1_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO0_20 (coord D13), U28[J8]/P0_20-EMC_A2
  @{ */
#define BOARD_INITPINS_EMC_A2_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EMC_A2_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EMC_A2_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO0_21 (coord C13), U28[J7]/P0_21-EMC_A3
  @{ */
#define BOARD_INITPINS_EMC_A3_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EMC_A3_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EMC_A3_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO1_4 (coord D4), U28[C2]/RP4[1]/P1_4-EMC_D11
  @{ */
#define BOARD_INITPINS_EMC_D11_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EMC_D11_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EMC_D11_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO1_5 (coord E4), U28[J3]/P1_5-EMC_A4
  @{ */
#define BOARD_INITPINS_EMC_A4_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EMC_A4_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EMC_A4_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                       /* @} */

