andreq114/SmartFridgeLPC/board/pin_mux.h
/*! @name PIO1_24 (coord N14), U28[G1]/P1_24-EMC_A12
  @{ */
#define BOARD_INITPINS_EMC_A12_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EMC_A12_PIN 24U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EMC_A12_PIN_MASK (1U << 24U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO1_25 (coord M12), U28[G7]/P1_25-EMC_A13
  @{ */
#define BOARD_INITPINS_EMC_A13_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EMC_A13_PIN 25U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EMC_A13_PIN_MASK (1U << 25U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO1_28 (coord E12), U28[C1]/RP2[4]/P1_28-EMC_D12
  @{ */
#define BOARD_INITPINS_EMC_D12_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EMC_D12_PIN 28U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EMC_D12_PIN_MASK (1U << 28U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO1_29 (coord C11), U28[B2]/RP2[3]/P1_29-EMC_D13
  @{ */
#define BOARD_INITPINS_EMC_D13_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EMC_D13_PIN 29U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EMC_D13_PIN_MASK (1U << 29U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO1_30 (coord A8), U28[B1]/RP2[2]/P1_30-EMC_D14
  @{ */
#define BOARD_INITPINS_EMC_D14_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EMC_D14_PIN 30U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EMC_D14_PIN_MASK (1U << 30U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO1_31 (coord C5), U28[A2]/RP2[1]/P1_31-EMC_D15
  @{ */
#define BOARD_INITPINS_EMC_D15_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EMC_D15_PIN 31U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EMC_D15_PIN_MASK (1U << 31U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO1_26 (coord J10), U28[H1]/P1_26-EMC_A8
  @{ */
#define BOARD_INITPINS_EMC_A8_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EMC_A8_PIN 26U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EMC_A8_PIN_MASK (1U << 26U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO1_27 (coord F10), U28[G3]/P1_27-EMC_A9
  @{ */
#define BOARD_INITPINS_EMC_A9_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EMC_A9_PIN 27U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EMC_A9_PIN_MASK (1U << 27U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO3_25 (coord P9), U28[G8]/P3_25-EMC_A14
  @{ */
#define BOARD_INITPINS_EMC_A14_PORT 3U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EMC_A14_PIN 25U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EMC_A14_PIN_MASK (1U << 25U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO2_11 (coord K3), J16[31]/P2_11-LCD_PWR
  @{ */
#define BOARD_INITPINS_LCD_PWR_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LCD_PWR_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_PWR_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO2_13 (coord P7), J16[30]/P2_13-LCD_DCLK
  @{ */
#define BOARD_INITPINS_LCD_DCLK_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LCD_DCLK_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_DCLK_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO2_14 (coord L7), J16[33]/P2_14-LCD_FP
  @{ */
#define BOARD_INITPINS_LCD_FP_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LCD_FP_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_FP_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO2_15 (coord M8), J16[34]/P2_15-LCD_AC_ENAB_M
  @{ */
#define BOARD_INITPINS_LCD_AC_ENAB_M_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LCD_AC_ENAB_M_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_AC_ENAB_M_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PIO2_16 (coord L8), J16[32]/P2_16-LCD_LP
  @{ */
#define BOARD_INITPINS_LCD_LP_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LCD_LP_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_LP_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO2_21 (coord L10), J16[8]/P2_21-LCD_VD3
  @{ */
#define BOARD_INITPINS_LCD_VD3_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LCD_VD3_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_VD3_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO2_22 (coord K10), J16[9]/P2_22-LCD_VD4
  @{ */
#define BOARD_INITPINS_LCD_VD4_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LCD_VD4_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_VD4_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO2_23 (coord M14), J16[10]/P2_23-LCD_VD5
  @{ */
#define BOARD_INITPINS_LCD_VD5_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LCD_VD5_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_VD5_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO2_24 (coord K14), J16[11]/P2_24-LCD_VD6
  @{ */
#define BOARD_INITPINS_LCD_VD6_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LCD_VD6_PIN 24U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_VD6_PIN_MASK (1U << 24U)      /*!<@brief PORT pin mask */
                                                         /* @} */

