andreq114/SmartFridgeLPC/board/pin_mux.h
/*! @name PIO2_25 (coord J11), J16[12]/P2_25-LCD_VD7
  @{ */
#define BOARD_INITPINS_LCD_VD7_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LCD_VD7_PIN 25U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_VD7_PIN_MASK (1U << 25U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO2_28 (coord G13), J16[15]/P2_28-LCD_VD10
  @{ */
#define BOARD_INITPINS_LCD_VD10_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LCD_VD10_PIN 28U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_VD10_PIN_MASK (1U << 28U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO2_29 (coord G11), J16[16]/P2_29-LCD_VD11
  @{ */
#define BOARD_INITPINS_LCD_VD11_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LCD_VD11_PIN 29U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_VD11_PIN_MASK (1U << 29U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO2_30 (coord F12), J16[17]/P2_30-LCD_VD12
  @{ */
#define BOARD_INITPINS_LCD_VD12_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LCD_VD12_PIN 30U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_VD12_PIN_MASK (1U << 30U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO2_31 (coord D14), J16[18]/P2_31-LCD_VD13
  @{ */
#define BOARD_INITPINS_LCD_VD13_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LCD_VD13_PIN 31U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_VD13_PIN_MASK (1U << 31U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO3_0 (coord D12), J16[19]/JS36[1]/P3_0-LCD_VD14
  @{ */
#define BOARD_INITPINS_LCD_VD14_PORT 3U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LCD_VD14_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_VD14_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO3_1 (coord D11), J16[20]/JS33[1]/P3_1-LCD_VD15
  @{ */
#define BOARD_INITPINS_LCD_VD15_PORT 3U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LCD_VD15_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_VD15_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO3_5 (coord B10), J16[24]/P3_5-LCD_VD19
  @{ */
#define BOARD_INITPINS_LCD_VD19_PORT 3U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LCD_VD19_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_VD19_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO3_6 (coord C9), J16[25]/P3_6-LCD_VD20
  @{ */
#define BOARD_INITPINS_LCD_VD20_PORT 3U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LCD_VD20_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_VD20_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO3_7 (coord B8), J16[26]/P3_7-LCD_VD21
  @{ */
#define BOARD_INITPINS_LCD_VD21_PORT 3U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LCD_VD21_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_VD21_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO3_8 (coord A7), J16[27]/P3_8-LCD_VD22
  @{ */
#define BOARD_INITPINS_LCD_VD22_PORT 3U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LCD_VD22_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_VD22_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO3_9 (coord C7), J16[28]/P3_9-LCD_VD23
  @{ */
#define BOARD_INITPINS_LCD_VD23_PORT 3U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LCD_VD23_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_VD23_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO3_23 (coord C2), J11[10]/J9[3]/U10[3]/J17[5]/U19[10]/P3_23-FC2_SDAX
  @{ */
#define BOARD_INITPINS_FC2_SDAX_PORT 3U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_FC2_SDAX_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_FC2_SDAX_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO3_24 (coord E2), J11[9]/J9[1]/U10[2]/J17[4]/U19[2]/P3_24-FC2_SCLX
  @{ */
#define BOARD_INITPINS_FC2_SCLX_PORT 3U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_FC2_SCLX_PIN 24U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_FC2_SCLX_PIN_MASK (1U << 24U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO1_22 (coord P11), J13[1]/P1_22-CT2MAT3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_BUZZ_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_BUZZ_GPIO_PIN_MASK (1U << 22U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_BUZZ_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_BUZZ_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_BUZZ_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M4F */

/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO016_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO016_FUNC_ALT0 0x00u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO10_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO10_FUNC_ALT0 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Pull-down.
 * Pull-down resistor enabled.
 */
#define PIO10_MODE_PULL_DOWN 0x01u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO314_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO314_FUNC_ALT0 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Pull-down.
 * Pull-down resistor enabled.
 */
#define PIO314_MODE_PULL_DOWN 0x01u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO320_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 1. */
#define PIO320_FUNC_ALT1 0x01u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO321_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 1. */
#define PIO321_FUNC_ALT1 0x01u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO322_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 1. */
#define PIO322_FUNC_ALT1 0x01u
/*!
 * @brief Select Analog/Digital mode.: Digital mode. */
#define PIO330_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 1. */
#define PIO330_FUNC_ALT1 0x01u

/*! @name PIO3_14 (coord E3), PWRON
  @{ */

