andreq114/SmartFridgeLPC/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITWIFI10CLICKSHIELD_PWRON_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITWIFI10CLICKSHIELD_PWRON_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */
#define BOARD_INITWIFI10CLICKSHIELD_PWRON_PORT 3U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITWIFI10CLICKSHIELD_PWRON_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITWIFI10CLICKSHIELD_PWRON_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                                    /* @} */

/*! @name PIO0_16 (coord M4), IRQ
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITWIFI10CLICKSHIELD_IRQ_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITWIFI10CLICKSHIELD_IRQ_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */
#define BOARD_INITWIFI10CLICKSHIELD_IRQ_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITWIFI10CLICKSHIELD_IRQ_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITWIFI10CLICKSHIELD_IRQ_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PIO1_0 (coord N3), KFET
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITWIFI10CLICKSHIELD_KFET_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITWIFI10CLICKSHIELD_KFET_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */
#define BOARD_INITWIFI10CLICKSHIELD_KFET_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITWIFI10CLICKSHIELD_KFET_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITWIFI10CLICKSHIELD_KFET_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitWiFi10ClickShield(void); /* Function assigned for the Cortex-M4F */

#define PIO20_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO20_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO21_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO21_FUNC_ALT2 0x02u         /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO311_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO311_FUNC_ALT2 0x02u        /*!<@brief Selects pin function.: Alternative connection 2. */
#define PIO45_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO45_FUNC_ALT3 0x03u         /*!<@brief Selects pin function.: Alternative connection 3. */
#define PIO47_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO47_FUNC_ALT0 0x00u         /*!<@brief Selects pin function.: Alternative connection 0. */

/*! @name PIO4_7 (coord A14), P4_7
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITRC522MODULE_RESET_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITRC522MODULE_RESET_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */
#define BOARD_INITRC522MODULE_RESET_PORT 4U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITRC522MODULE_RESET_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITRC522MODULE_RESET_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PIO3_11 (coord B2), J11[8]/J12[7]/P3_11-MCLK-PMOD2_GPIO
  @{ */
#define BOARD_INITRC522MODULE_MCLK_PORT 3U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITRC522MODULE_MCLK_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITRC522MODULE_MCLK_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitRC522Module(void); /* Function assigned for the Cortex-M4F */

#define PIO023_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO023_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO024_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO024_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO025_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO025_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO026_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO026_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO027_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO027_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO028_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO028_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */

/*! @name PIO0_23 (coord N7), J13[8]/U27[1]/P0_23-SPIFI_CSn-MCLK
  @{ */
#define BOARD_INITSPIFI_SPIFI_CSn_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSPIFI_SPIFI_CSn_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_INITSPIFI_SPIFI_CSn_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PIO0_24 (coord M7), J13[6]/U27[5]/P0_24-SPIFI_IO0
  @{ */
#define BOARD_INITSPIFI_SPIFI_IO0_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSPIFI_SPIFI_IO0_PIN 24U                   /*!<@brief PORT pin number */
#define BOARD_INITSPIFI_SPIFI_IO0_PIN_MASK (1U << 24U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PIO0_25 (coord K8), J13[4]/U27[2]/P0_25-SPIFI_IO1
  @{ */
#define BOARD_INITSPIFI_SPIFI_IO1_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSPIFI_SPIFI_IO1_PIN 25U                   /*!<@brief PORT pin number */
#define BOARD_INITSPIFI_SPIFI_IO1_PIN_MASK (1U << 25U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PIO0_26 (coord M13), J13[2]/U27[6]/P0_26-SPIFI_CLK
  @{ */
#define BOARD_INITSPIFI_SPIFI_CLK_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSPIFI_SPIFI_CLK_PIN 26U                   /*!<@brief PORT pin number */
#define BOARD_INITSPIFI_SPIFI_CLK_PIN_MASK (1U << 26U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PIO0_27 (coord L9), J13[12]/U27[7]/P0_27-SPIFI_IO3
  @{ */
#define BOARD_INITSPIFI_SPIFI_IO3_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSPIFI_SPIFI_IO3_PIN 27U                   /*!<@brief PORT pin number */
#define BOARD_INITSPIFI_SPIFI_IO3_PIN_MASK (1U << 27U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PIO0_28 (coord M9), J13[10]/U27[3]/P0_28-SPIFI_IO2-USB0_OCURRn
  @{ */
#define BOARD_INITSPIFI_SPIFI_IO2_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSPIFI_SPIFI_IO2_PIN 28U                   /*!<@brief PORT pin number */
#define BOARD_INITSPIFI_SPIFI_IO2_PIN_MASK (1U << 28U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSPIFI(void); /* Function assigned for the Cortex-M4F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
